Revit 2024 API
ContinuousRail.Length Property
 The length of the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double Length { get; }
Visual Basic
Public ReadOnly Property Length As Double
	Get
Visual C++
public:
property double Length {
	double get ();
}
See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace